; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	image0 - mode
	image1 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star2 - direction
	Star6 - direction
	GroundStation0 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument5 image1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 image0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation7)
	(supports instrument8 image0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star2)
	(supports instrument9 image1)
	(supports instrument9 image0)
	(calibration_target instrument9 Star6)
	(supports instrument10 image1)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon14)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Phenomenon12)
	(pointing satellite3 GroundStation7)
	(pointing satellite4 GroundStation5)
	(pointing satellite5 GroundStation0)
	(have_image Phenomenon8 image0)
	(have_image Phenomenon9 image0)
	(have_image Phenomenon10 image0)
	(have_image Planet11 image1)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 image1)
	(have_image Phenomenon14 image1)
	(have_image Star15 image1)
))

)

; plan
1. (turn_to satellite5 groundstation0 phenomenon14)
   deleted: (pointing satellite5 phenomenon14)
   added: (pointing satellite5 groundstation0)
   goals met: 1 of 13
2. (turn_to satellite4 groundstation5 groundstation7)
   deleted: (pointing satellite4 groundstation7)
   added: (pointing satellite4 groundstation5)
   goals met: 2 of 13
3. (turn_to satellite3 groundstation7 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation7)
   goals met: 3 of 13
4. (turn_to satellite1 groundstation7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 groundstation7)
   goals met: 3 of 13
5. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 13
6. (calibrate satellite1 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 3 of 13
7. (turn_to satellite1 phenomenon14 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 13
8. (take_image satellite1 phenomenon14 instrument1 image1)
   added: (have_image phenomenon14 image1)
   goals met: 4 of 13
9. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 13
10. (take_image satellite1 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 5 of 13
11. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 13
12. (turn_to satellite0 star2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star2)
   goals met: 6 of 13
13. (take_image satellite1 phenomenon10 instrument1 image0)
   added: (have_image phenomenon10 image0)
   goals met: 7 of 13
14. (turn_to satellite1 phenomenon8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon8)
   goals met: 7 of 13
15. (take_image satellite1 phenomenon8 instrument1 image0)
   added: (have_image phenomenon8 image0)
   goals met: 8 of 13
16. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   goals met: 8 of 13
17. (take_image satellite1 phenomenon9 instrument1 image0)
   added: (have_image phenomenon9 image0)
   goals met: 9 of 13
18. (turn_to satellite1 planet11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet11)
   goals met: 9 of 13
19. (take_image satellite1 planet11 instrument1 image1)
   added: (have_image planet11 image1)
   goals met: 10 of 13
20. (turn_to satellite1 star15 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star15)
   goals met: 10 of 13
21. (take_image satellite1 star15 instrument1 image1)
   added: (have_image star15 image1)
   goals met: 11 of 13
22. (turn_to satellite1 phenomenon12 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 phenomenon12)
   goals met: 12 of 13
23. (take_image satellite1 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 13 of 13
